ESI/hsSphere_rcf_AMR/0.orig/U
/*--------------------------------*- C++ -*----------------------------------* \
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          (762 0 0);//(2.5 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $Uinlet;

boundaryField
{
    inlet1
    {
        type            fixedValue;
        value           uniform $Uinlet;

    }
    outlet1
    {
        type            zeroGradient;
    }
    walls
    {
        type            slip;
    }
    sphere
    {
        type            noSlip;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
